1s/ERP/Conf/Catalogs/Лико_ЛицевойМатериал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ЛицевойМатериал</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>95</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Толщина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ЛицевойМатериал/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Наименование = СокрЛП(Имя) + ?(ЗначениеЗаполнено(Толщина)," " + Строка(Толщина),"");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЛицевойМатериал.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ЛицевойМатериал КАК Лико_ЛицевойМатериал
	|ГДЕ
	|	Лико_ЛицевойМатериал.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка = ЭтотОбъект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Отказ = Истина;
		Сообщить("Элемент """ + Наименование + """ уже существует");
	КонецЦикла;
	
КонецПроцедуры
